In [32]:
import pandas as pd

In [33]:
df=pd.DataFrame({'name':['John Arthur Doe', 'Jane Ann Smith'], 'location':['Los Angeles, CA', 'Washington, DC']})

In [34]:
df

              name         location
0  John Arthur Doe  Los Angeles, CA
1   Jane Ann Smith   Washington, DC

In [36]:
df.name.str.split(' ', expand=True)

      0       1      2
0  John  Arthur    Doe
1  Jane     Ann  Smith

In [28]:
df[['first', 'middle', 'last']]=df.name.str.split(' ', expand=True)
df

              name         location first  middle   last
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith

In [29]:
df.location.str.split(",", expand=True)

             0    1
0  Los Angeles   CA
1   Washington   DC

In [30]:
df[['City']]=df.location.str.split(",", expand=True)[1]

In [31]:
df

              name         location first  middle   last City
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe   CA
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith   DC